jmeter_tests/aggregatereport100.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,300,11,6,25,43,73,2,86,50.000%,2.84201,6.65,1.75
http://127.0.0.1:8000/,300,1314,843,3403,3833,4251,75,4520,0.000%,3.17521,17.47,1.69
http://127.0.0.1:8000/cart/,150,301,276,533,568,636,79,660,0.000%,1.62134,6.39,0.87
http://127.0.0.1:8000/checkout/,150,191,169,304,326,504,80,514,0.000%,1.61826,9.21,0.95
http://127.0.0.1:8000/save-shipping-address/,150,367,245,770,890,1311,83,1352,0.000%,1.60908,6.38,1.47
Test,150,3513,3398,6198,6445,6673,704,6801,100.000%,1.03820,30.40,4.50
TOTAL,1200,878,254,3063,4247,6257,2,6801,25.000%,8.30559,60.79,9.01