jmeter_tests/aggregatereport100_2.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,1902,18,4,45,90,317,0,442,74.185%,.73854,1.82,0.27
http://127.0.0.1:8000/,1902,6295,482,9386,50788,83257,0,91926,41.115%,.74171,18.59,0.26
http://127.0.0.1:8000/cart/,951,6810,196,34391,54489,71188,0,71787,43.218%,.37108,10.06,0.14
http://127.0.0.1:8000/checkout/,951,802,135,467,1387,4164,0,71440,29.443%,.37102,2.49,0.15
http://127.0.0.1:8000/save-shipping-address/,951,1795,177,2329,4585,59503,0,62628,32.282%,.37099,3.19,0.25
Test,951,22037,2521,86099,88723,93978,4,94961,100.000%,.36374,35.46,1.05
TOTAL,7608,5509,113,5784,56863,87317,0,94961,54.443%,2.90991,70.91,2.09