jmeter_tests/aggregatereport50.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,100,9,5,18,33,71,2,86,50.000%,5.28849,12.37,3.26
http://127.0.0.1:8000/,100,497,349,1133,1193,1344,75,1529,0.000%,21.31742,117.29,11.37
http://127.0.0.1:8000/cart/,50,209,181,343,389,502,91,502,0.000%,20.45827,80.63,11.01
http://127.0.0.1:8000/checkout/,50,152,129,222,236,307,80,307,0.000%,19.53125,111.14,11.43
http://127.0.0.1:8000/save-shipping-address/,50,193,189,290,307,362,86,362,0.000%,18.23487,72.28,16.69
Test,50,1570,1502,2388,2452,2919,704,2919,100.000%,.92593,27.11,4.02
TOTAL,400,392,162,1145,1634,2437,2,2919,25.000%,7.40727,54.22,8.03